docs:  README mermaid style fot architecture
